# Toplulaştırma ve Gruplama ( Aggregation and Grouping)

### Basit toplulaştırma fonksiyonları(simple Aggregation functions):

count()

first()

last()

mean()

median()

min()

max()

std()

var()

sum()

In [61]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\users\90530\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [26]:
#df = sns.load_dataset('planets') çalışmıyor

In [27]:
#sns.load_dataset("planets") çalıştıramadım

In [5]:
pd.read_csv("planets.csv")

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [6]:
df = pd.read_csv("planets.csv")

In [7]:
df.shape

(1035, 6)

In [8]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [12]:
df["mass"].mean()

2.6381605847953216

In [13]:
df["mass"].count()

513

In [14]:
df["mass"].min()

0.0036

In [15]:
df["mass"].max()

25.0

In [16]:
df["mass"].sum()

1353.37638

In [17]:
df["mass"].std()

3.8186166509616046

In [18]:
df["mass"].var()

14.58183312700122

In [21]:
df.mean(numeric_only = True)

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [22]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [78]:
df.describe().T #transpose

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [25]:
df.dropna().describe().T #eksik değerleri drop

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama İşlemleri grupların yakalanması ve üzerilerinde bir takım işlemler yapılması

In [28]:
df4 = pd.DataFrame({"gruplar" : ["A", "B", "C", "A", "B", "C"],
                   "veri" : [10 ,11,52,23,43,55]}, columns = ["gruplar", "veri"])
df4

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [29]:
df4.groupby("gruplar")

In [30]:
df4.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [31]:
df4.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [32]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [33]:
df.groupby("method")

In [34]:
df.groupby("method")["orbital_period"]

In [35]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [38]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [39]:
df.dropna().groupby("method")["mass"].mean()

method
Radial Velocity    2.511411
Transit            1.470000
Name: mass, dtype: float64

# İleri toplulaştırma işlmeleri ( aggregate, filter, transform, apply)

In [40]:
import pandas as pd
df5 = pd.DataFrame({"gruplar" : ["A", "B", "C", "A", "B", "C"],
                   "degisken1" : [10 ,23, 33, 22, 11, 99],
                   "degisken2" : [100, 253, 333, 262 ,111, 969]}, 
                   columns = ["gruplar", "degisken1", "degisken2"])
df5

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [41]:
#aggregate

In [43]:
df5.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [44]:
df5.groupby("gruplar").aggregate(["min", np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [45]:
df5.groupby("gruplar").aggregate([min, np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [49]:
df5.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [50]:
df5.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": np.median})

         degisken1  degisken2
gruplar
A               10      181.0
B               11      182.0
C               33      651.0

In [51]:
#filter

In [57]:
df5

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [55]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [58]:
df5.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [56]:
df5.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [60]:
#transform - kendi tanımladığımız bir fonksiyonla dönüştürme uygulama

In [62]:
df5["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [63]:
df_a =  df5.iloc[:,1:3]

In [66]:
df_a.transform(lambda x : x - x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [67]:
df_a.transform(lambda x : (x - x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [71]:
#apply fonsiyonu - değişkenleerin üzerinde gezinme  aggregation yeteneğini olan

In [69]:
df6 =  pd.DataFrame({"gruplar" : ["A", "B", "C", "A", "B", "C"],
                   "degisken1" : [10 ,23, 33, 22, 11, 99],
                   "degisken2" : [100, 253, 333, 262 ,111, 969]}, 
                   columns = ["degisken1", "degisken2"])

In [70]:
df6

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [72]:
df6.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [73]:
df6.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [74]:
df7 =  pd.DataFrame({"gruplar" : ["A", "B", "C", "A", "B", "C"],
                   "degisken1" : [10 ,23, 33, 22, 11, 99],
                   "degisken2" : [100, 253, 333, 262 ,111, 969]}, 
                   columns = ["gruplar","degisken1", "degisken2"])

In [75]:
df7

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [76]:
df7.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [77]:
df7.groupby("gruplar").apply(np.mean)

gruplar
A     98.5
B     99.5
C    358.5
dtype: float64

deneme deneme